vim.pack.add({
  "https://github.com/nvimdev/dashboard-nvim",
})

local db = require("dashboard")

local logo = [[


  ██████  ███▄ ▄███▓ ██▓ ██▓    ▓█████  ███▄ ▄███▓ ██▓  ██████  ▄▄▄       ██ ▄█▀ ▄▄▄      
▒██    ▒ ▓██▒▀█▀ ██▒▓██▒▓██▒    ▓█   ▀ ▓██▒▀█▀ ██▒▓██▒▒██    ▒ ▒████▄     ██▄█▒ ▒████▄    
░ ▓██▄   ▓██    ▓██░▒██▒▒██░    ▒███   ▓██    ▓██░▒██▒░ ▓██▄   ▒██  ▀█▄  ▓███▄░ ▒██  ▀█▄  
  ▒   ██▒▒██    ▒██ ░██░▒██░    ▒▓█  ▄ ▒██    ▒██ ░██░  ▒   ██▒░██▄▄▄▄██ ▓██ █▄ ░██▄▄▄▄██ 
▒██████▒▒▒██▒   ░██▒░██░░██████▒░▒████▒▒██▒   ░██▒░██░▒██████▒▒ ▓█   ▓██▒▒██▒ █▄ ▓█   ▓██▒
▒ ▒▓▒ ▒ ░░ ▒░   ░  ░░▓  ░ ▒░▓  ░░░ ▒░ ░░ ▒░   ░  ░░▓  ▒ ▒▓▒ ▒ ░ ▒▒   ▓▒█░▒ ▒▒ ▓▒ ▒▒   ▓▒█░
░ ░▒  ░ ░░  ░      ░ ▒ ░░ ░ ▒  ░ ░ ░  ░░  ░      ░ ▒ ░░ ░▒  ░ ░  ▒   ▒▒ ░░ ░▒ ▒░  ▒   ▒▒ ░
░  ░  ░  ░      ░    ▒ ░  ░ ░      ░   ░      ░    ▒ ░░  ░  ░    ░   ▒   ░ ░░ ░   ░   ▒   
      ░         ░    ░      ░  ░   ░  ░       ░    ░        ░        ░  ░░  ░         ░  ░

]]

local opts = {
  theme = "doom",
  hide = {
    statusline = false,
  },
  config = {
    vertical_center = true,
    header = vim.split(logo, "\n"),
    center = {
      {
        action = "lua FzfLua.files()",
        desc = " Find File",
        icon = " ",
        key = "f",
      },
      {
        action = "ene | startinsert",
        desc = " New File",
        icon = " ",
        key = "n",
      },
      {
        action = "lua FzfLua.oldfiles()",
        desc = " Recent Files",
        icon = " ",
        key = "r",
      },
      {
        action = "lua FzfLua.live_grep()",
        desc = " Find Text",
        icon = " ",
        key = "g",
      },
      {
        action = "lua FzfLua.files({ cwd = '~/.config/nvim'})",
        desc = " Config",
        icon = " ",
        key = "c",
      },
      {
        action = function()
          require("plugins.persistence").load()
          require("persistence").load()
        end,
        desc = " Restore Session",
        icon = "󰍲 ",
        key = "s",
      },
      {
        action = function()
          vim.api.nvim_input("<cmd>qa<cr>")
        end,
        desc = " Quit",
        icon = " ",
        key = "q",
      },
    },
    footer = {
      "⚡ Neovim loaded successfully",
    },
  },
}

for _, button in ipairs(opts.config.center) do
  button.desc = button.desc .. string.rep(" ", 43 - #button.desc)
  button.key_format = "  %s"
end

db.setup(opts)
